# Fifa RAW data Transformation

Steps 
- Importing Libraries
- Importing data
- EDAAAAAAAAAAAAAAAA

In [1]:
#Importing Libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import warnings
import seaborn as srn
import math
import random
import datetime
warnings.filterwarnings('ignore')

In [2]:
df = pd.read_csv('fifa21_raw_data.csv')
df.head()

,ID,Name,LongName,photoUrl,playerUrl,Nationality,Age,↓OVA,POT,Club,...,A/W,D/W,IR,PAC,SHO,PAS,DRI,DEF,PHY,Hits
0,158023,L. Messi,Lionel Messi,https://cdn.sofifa.com/players/158/023/21_60.png,http://sofifa.com/player/158023/lionel-messi/2...,Argentina,33,93,93,\n\n\n\nFC Barcelona,...,Medium,Low,5 ★,85,92,91,95,38,65,771
1,20801,Cristiano Ronaldo,C. Ronaldo dos Santos Aveiro,https://cdn.sofifa.com/players/020/801/21_60.png,http://sofifa.com/player/20801/c-ronaldo-dos-s...,Portugal,35,92,92,\n\n\n\nJuventus,...,High,Low,5 ★,89,93,81,89,35,77,562
2,200389,J. Oblak,Jan Oblak,https://cdn.sofifa.com/players/200/389/21_60.png,http://sofifa.com/player/200389/jan-oblak/210006/,Slovenia,27,91,93,\n\n\n\nAtlético Madrid,...,Medium,Medium,3 ★,87,92,78,90,52,90,150
3,192985,K. De Bruyne,Kevin De Bruyne,https://cdn.sofifa.com/players/192/985/21_60.png,http://sofifa.com/player/192985/kevin-de-bruyn...,Belgium,29,91,91,\n\n\n\nManchester City,...,High,High,4 ★,76,86,93,88,64,78,207
4,190871,Neymar Jr,Neymar da Silva Santos Jr.,https://cdn.sofifa.com/players/190/871/21_60.png,http://sofifa.com/player/190871/neymar-da-silv...,Brazil,28,91,91,\n\n\n\nParis Saint-Germain,...,High,Medium,5 ★,91,85,86,94,36,59,595

In [3]:
df.shape

(18979, 77)

In [4]:
df.isna().sum()

ID              0
Name            0
LongName        0
photoUrl        0
playerUrl       0
             ...
PAS             0
DRI             0
DEF             0
PHY             0
Hits         2595
Length: 77, dtype: int64

In [5]:
df.duplicated().sum()

0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18979 entries, 0 to 18978
Data columns (total 77 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                18979 non-null  int64
 1   Name              18979 non-null  object
 2   LongName          18979 non-null  object
 3   photoUrl          18979 non-null  object
 4   playerUrl         18979 non-null  object
 5   Nationality       18979 non-null  object
 6   Age               18979 non-null  int64
 7   ↓OVA              18979 non-null  int64
 8   POT               18979 non-null  int64
 9   Club              18979 non-null  object
 10  Contract          18979 non-null  object
 11  Positions         18979 non-null  object
 12  Height            18979 non-null  object
 13  Weight            18979 non-null  object
 14  Preferred Foot    18979 non-null  object
 15  BOV               18979 non-null  int64
 16  Best Position     18979 non-null  object
 17  Joined            18979 non-null  object
 18  Loan Date End     1013 non-null   object
 19  Value             18979 non-null  object
 20  Wage              18979 non-null  object
 21  Release Clause    18979 non-null  object
 22  Attacking         18979 non-null  int64
 23  Crossing          18979 non-null  int64
 24  Finishing         18979 non-null  int64
 25  Heading Accuracy  18979 non-null  int64
 26  Short Passing     18979 non-null  int64
 27  Volleys           18979 non-null  int64
 28  Skill             18979 non-null  int64
 29  Dribbling         18979 non-null  int64
 30  Curve             18979 non-null  int64
 31  FK Accuracy       18979 non-null  int64
 32  Long Passing      18979 non-null  int64
 33  Ball Control      18979 non-null  int64
 34  Movement          18979 non-null  int64
 35  Acceleration      18979 non-null  int64
 36  Sprint Speed      18979 non-null  int64
 37  Agility           18979 non-null  int64
 38  Reactions         18979 non-null  int64
 39  Balance           18979 non-null  int64
 40  Power             18979 non-null  int64
 41  Shot Power        18979 non-null  int64
 42  Jumping           18979 non-null  int64
 43  Stamina           18979 non-null  int64
 44  Strength          18979 non-null  int64
 45  Long Shots        18979 non-null  int64
 46  Mentality         18979 non-null  int64
 47  Aggression        18979 non-null  int64
 48  Interceptions     18979 non-null  int64
 49  Positioning       18979 non-null  int64
 50  Vision            18979 non-null  int64
 51  Penalties         18979 non-null  int64
 52  Composure         18979 non-null  int64
 53  Defending         18979 non-null  int64
 54  Marking           18979 non-null  int64
 55  Standing Tackle   18979 non-null  int64
 56  Sliding Tackle    18979 non-null  int64
 57  Goalkeeping       18979 non-null  int64
 58  GK Diving         18979 non-null  int64
 59  GK Handling       18979 non-null  int64
 60  GK Kicking        18979 non-null  int64
 61  GK Positioning    18979 non-null  int64
 62  GK Reflexes       18979 non-null  int64
 63  Total Stats       18979 non-null  int64
 64  Base Stats        18979 non-null  int64
 65  W/F               18979 non-null  object
 66  SM                18979 non-null  object
 67  A/W               18979 non-null  object
 68  D/W               18979 non-null  object
 69  IR                18979 non-null  object
 70  PAC               18979 non-null  int64
 71  SHO               18979 non-null  int64
 72  PAS               18979 non-null  int64
 73  DRI               18979 non-null  int64
 74  DEF               18979 non-null  int64
 75  PHY               18979 non-null  int64
 76  Hits              16384 non-null  object
dtypes: int64(54), object(23)
memory usage: 11.1+ MB

In [7]:
df[['ID','Name','LongName']]

           ID               Name                      LongName
0      158023           L. Messi                  Lionel Messi
1       20801  Cristiano Ronaldo  C. Ronaldo dos Santos Aveiro
2      200389           J. Oblak                     Jan Oblak
3      192985       K. De Bruyne               Kevin De Bruyne
4      190871          Neymar Jr    Neymar da Silva Santos Jr.
...       ...                ...                           ...
18974  247223             Xia Ao                        Ao Xia
18975  258760           B. Hough                     Ben Hough
18976  252757        R. McKinley                Ronan McKinley
18977  243790       Wang Zhen'ao                  Zhen'ao Wang
18978  252520          Zhou Xiao                     Xiao Zhou

[18979 rows x 3 columns]

In [8]:
df[['↓OVA','POT','Club']]

       ↓OVA  POT                         Club
0        93   93         \n\n\n\nFC Barcelona
1        92   92             \n\n\n\nJuventus
2        91   93      \n\n\n\nAtlético Madrid
3        91   91      \n\n\n\nManchester City
4        91   91  \n\n\n\nParis Saint-Germain
...     ...  ...                          ...
18974    47   55           \n\n\n\nWuhan Zall
18975    47   67      \n\n\n\nOldham Athletic
18976    47   65           \n\n\n\nDerry City
18977    47   57     \n\n\n\nDalian YiFang FC
18978    47   57     \n\n\n\nDalian YiFang FC

[18979 rows x 3 columns]

We observe there are too many new line characters and those have to be deleted.

In [9]:
for i in df['Club'].unique():
    try:
        df['Club'].replace(i,i.replace('\n',''),inplace = True)
    except:
        pass

In [10]:
df['Club'].head()

0           FC Barcelona
1               Juventus
2        Atlético Madrid
3        Manchester City
4    Paris Saint-Germain
Name: Club, dtype: object

In [11]:
df[['Contract','Positions']]

          Contract   Positions
0      2004 ~ 2021  RW, ST, CF
1      2018 ~ 2022      ST, LW
2      2014 ~ 2023          GK
3      2015 ~ 2023     CAM, CM
4      2017 ~ 2022     LW, CAM
...            ...         ...
18974  2018 ~ 2022          CB
18975  2020 ~ 2021          CM
18976  2019 ~ 2020          CM
18977  2020 ~ 2022          RW
18978  2019 ~ 2023      CB, LB

[18979 rows x 2 columns]

In [12]:
for i in df['Contract'].unique():
    try:
        df['Contract'].replace(i,i.replace('~','-'),inplace = True)
    except:
        pass
df['Contract'].head()

0    2004 - 2021
1    2018 - 2022
2    2014 - 2023
3    2015 - 2023
4    2017 - 2022
Name: Contract, dtype: object

In [13]:
df[['Height','Weight','Preferred Foot']]

      Height Weight Preferred Foot
0      170cm   72kg           Left
1      187cm   83kg          Right
2      188cm   87kg          Right
3      181cm   70kg          Right
4      175cm   68kg          Right
...      ...    ...            ...
18974  178cm   66kg          Right
18975  175cm   65kg          Right
18976  179cm   74kg          Right
18977  175cm   69kg          Right
18978  188cm   75kg           Left

[18979 rows x 3 columns]

In [14]:
df["Height"].unique()

array(['170cm', '187cm', '188cm', '181cm', '175cm', '184cm', '191cm',
       '178cm', '193cm', '185cm', '199cm', '173cm', '168cm', '176cm',
       '177cm', '183cm', '180cm', '189cm', '179cm', '195cm', '172cm',
       '182cm', '186cm', '192cm', '165cm', '194cm', '167cm', '196cm',
       '163cm', '190cm', '174cm', '169cm', '171cm', '197cm', '200cm',
       '166cm', '6\'2"', '164cm', '198cm', '6\'3"', '6\'5"', '5\'11"',
       '6\'4"', '6\'1"', '6\'0"', '5\'10"', '5\'9"', '5\'6"', '5\'7"',
       '5\'4"', '201cm', '158cm', '162cm', '161cm', '160cm', '203cm',
       '157cm', '156cm', '202cm', '159cm', '206cm', '155cm'], dtype=object)

In [15]:
def height(x):
    k = x.replace('\'','.').replace('"','').split('.')
    centi = round((float(k[0])*12*2.54) + (float(k[1])*2.54),2)
    return centi

for i in df['Height'].unique():     
        try:
            df['Height'].replace(i,i.replace('cm',''),inplace = True)
            df['Height'].replace(i,height(i), inplace = True)
        except:
            pass

In [16]:
df["Height"].unique()

array(['170', '187', '188', '181', '175', '184', '191', '178', '193',
       '185', '199', '173', '168', '176', '177', '183', '180', '189',
       '179', '195', '172', '182', '186', '192', '165', '194', '167',
       '196', '163', '190', '174', '169', '171', '197', '200', '166',
       187.96, '164', '198', 190.5, 195.58, 180.34, 193.04, 185.42,
       182.88, 177.8, 175.26, 167.64, 170.18, 162.56, '201', '158', '162',
       '161', '160', '203', '157', '156', '202', '159', '206', '155'],
      dtype=object)

In [18]:
df['Height'] = pd.to_numeric(df['Height']) 
df['Height'].dtype

dtype('float64')

In [19]:
df["Weight"].unique()

array(['72kg', '83kg', '87kg', '70kg', '68kg', '80kg', '71kg', '91kg',
       '73kg', '85kg', '92kg', '69kg', '84kg', '96kg', '81kg', '82kg',
       '75kg', '86kg', '89kg', '74kg', '76kg', '64kg', '78kg', '90kg',
       '66kg', '60kg', '94kg', '79kg', '67kg', '65kg', '59kg', '61kg',
       '93kg', '88kg', '97kg', '77kg', '62kg', '63kg', '95kg', '100kg',
       '58kg', '183lbs', '179lbs', '172lbs', '196lbs', '176lbs', '185lbs',
       '170lbs', '203lbs', '168lbs', '161lbs', '146lbs', '130lbs',
       '190lbs', '174lbs', '148lbs', '165lbs', '159lbs', '192lbs',
       '181lbs', '139lbs', '154lbs', '157lbs', '163lbs', '98kg', '103kg',
       '99kg', '102kg', '56kg', '101kg', '57kg', '55kg', '104kg', '107kg',
       '110kg', '53kg', '50kg', '54kg', '52kg'], dtype=object)

In [20]:
def weight(x):
    if x[3:6]=='lbs':
        k = x.replace('lbs','.').split('.')
        kg = round(float(k[0])*0.45,1)
    else:
        pass
    return kg

for i in df['Weight'].unique():     
        try:
            df['Weight'].replace(i,i.replace('kg',''),inplace = True)
            df['Weight'].replace(i,weight(i), inplace = True)
        except:
            pass

In [21]:
df["Weight"].unique()

array(['72', '83', '87', '70', '68', '80', '71', '91', '73', '85', '92',
       '69', '84', '96', '81', '82', '75', '86', '89', '74', '76', '64',
       '78', '90', '66', '60', '94', '79', '67', '65', '59', '61', '93',
       '88', '97', '77', '62', '63', '95', '100', '58', 82.4, 80.5, 77.4,
       88.2, 79.2, 83.2, 76.5, 91.4, 75.6, 72.5, 65.7, 58.5, 85.5, 78.3,
       66.6, 74.2, 71.5, 86.4, 81.5, 62.6, 69.3, 70.7, 73.4, '98', '103',
       '99', '102', '56', '101', '57', '55', '104', '107', '110', '53',
       '50', '54', '52'], dtype=object)

In [22]:
df['Weight'] = pd.to_numeric(df['Weight']) 
df['Weight'].dtype

dtype('float64')

In [23]:
df[['BOV','Best Position']]

       BOV Best Position
0       93            RW
1       92            ST
2       91            GK
3       91           CAM
4       91            LW
...    ...           ...
18974   49            CB
18975   51           CAM
18976   49           CAM
18977   48            ST
18978   50            LB

[18979 rows x 2 columns]

In [24]:
df[['Joined','Loan Date End']]

             Joined Loan Date End
0       Jul 1, 2004           NaN
1      Jul 10, 2018           NaN
2      Jul 16, 2014           NaN
3      Aug 30, 2015           NaN
4       Aug 3, 2017           NaN
...             ...           ...
18974  Jul 13, 2018           NaN
18975   Aug 1, 2020           NaN
18976   Mar 8, 2019           NaN
18977  Sep 22, 2020           NaN
18978  Jul 29, 2019           NaN

[18979 rows x 2 columns]

In [25]:
df['Loan Date End'].unique()

array([nan, 'Jun 30, 2021', 'Dec 31, 2020', 'Jan 30, 2021',
       'Jun 30, 2022', 'May 31, 2021', 'Jul 5, 2021', 'Dec 31, 2021',
       'Jul 1, 2021', 'Jan 1, 2021', 'Aug 31, 2021', 'Jan 31, 2021',
       'Dec 30, 2021', 'Jun 23, 2021', 'Jan 3, 2021', 'Nov 27, 2021',
       'Jan 17, 2021', 'Jun 30, 2023', 'Jul 31, 2021', 'Nov 22, 2020',
       'May 31, 2022', 'Dec 30, 2020', 'Jan 4, 2021', 'Nov 30, 2020',
       'Aug 1, 2021'], dtype=object)

We should change the dates from words to actual dates

In [27]:
for i in list(df['Joined'].unique()):
    try:
        xx = datetime.datetime.strptime(i,'%b %d, %Y').strftime('%d/%m/%Y')
        f = '%d/%m/%Y'
        df['Joined'].replace(i,datetime.datetime.strptime(xx,f),inplace=True)
    except:
        pass

In [28]:
df['Joined'].head()

0   2004-07-01
1   2018-07-10
2   2014-07-16
3   2015-08-30
4   2017-08-03
Name: Joined, dtype: datetime64[ns]

In [29]:
for j in list(df['Loan Date End'].unique()):
    try:
        xx1 = datetime.datetime.strptime(j,'%b %d, %Y').strftime('%d/%m/%Y')
        f1 = '%d/%m/%Y'
        df['Loan Date End'].replace(j,datetime.datetime.strptime(xx1,f1),inplace=True)
    except:
        pass

In [30]:
df['Loan Date End'].unique()

array([                          'NaT', '2021-06-30T00:00:00.000000000',
       '2020-12-31T00:00:00.000000000', '2021-01-30T00:00:00.000000000',
       '2022-06-30T00:00:00.000000000', '2021-05-31T00:00:00.000000000',
       '2021-07-05T00:00:00.000000000', '2021-12-31T00:00:00.000000000',
       '2021-07-01T00:00:00.000000000', '2021-01-01T00:00:00.000000000',
       '2021-08-31T00:00:00.000000000', '2021-01-31T00:00:00.000000000',
       '2021-12-30T00:00:00.000000000', '2021-06-23T00:00:00.000000000',
       '2021-01-03T00:00:00.000000000', '2021-11-27T00:00:00.000000000',
       '2021-01-17T00:00:00.000000000', '2023-06-30T00:00:00.000000000',
       '2021-07-31T00:00:00.000000000', '2020-11-22T00:00:00.000000000',
       '2022-05-31T00:00:00.000000000', '2020-12-30T00:00:00.000000000',
       '2021-01-04T00:00:00.000000000', '2020-11-30T00:00:00.000000000',
       '2021-08-01T00:00:00.000000000'], dtype='datetime64[ns]')

In [31]:
df[['Value','Wage','Release Clause']]

         Value   Wage Release Clause
0      €103.5M  €560K        €138.4M
1         €63M  €220K         €75.9M
2        €120M  €125K        €159.4M
3        €129M  €370K          €161M
4        €132M  €270K        €166.5M
...        ...    ...            ...
18974    €100K    €1K           €70K
18975    €130K   €500          €165K
18976    €120K   €500          €131K
18977    €100K    €2K           €88K
18978    €100K    €1K           €79K

[18979 rows x 3 columns]

In [32]:
df['Value'] = df['Value'].str.replace('\W', '', regex=True)
df['Value'].head()

0    1035M
1      63M
2     120M
3     129M
4     132M
Name: Value, dtype: object

In [33]:
for i in df['Value'].unique():
    if 'M' in i:
        df['Value'].replace(i,(i.replace('M','.').split('.'))[0]*1000000,inplace = True)
    elif 'K'in i:
        df['Value'].replace(i,(i.replace('K','.').split('.'))[0]*1000,inplace = True)
    else:
        pass

In [ ]:
df['Value'].unique()

In [ ]:
df['Wage'] = df['Wage'].str.replace('\W', '', regex=True)
df['Wage'].head()

In [ ]:
for i in df['Wage'].unique():
    if 'M' in i:
        df['Wage'].replace(i,(i.replace('M','.').split('.'))[0]*1000000,inplace = True)
    elif 'K'in i:
        df['Wage'].replace(i,(i.replace('K','.').split('.'))[0]*1000,inplace = True)
    else:
        pass

In [ ]:
df['Wage'].unique()

In [ ]:
df['Release Clause'] = df['Release Clause'].str.replace('\W', '', regex=True)
df['Release Clause'].head()

In [ ]:
for i in df['Release Clause'].unique():
    if 'M' in i:
        df['Release Clause'].replace(i,(i.replace('M','.').split('.'))[0]*1000000,inplace = True)
    elif 'K'in i:
        df['Release Clause'].replace(i,(i.replace('K','.').split('.'))[0]*1000,inplace = True)
    else:
        pass

In [ ]:
df['Release Clause'].unique()

In [ ]:
df['IR'].head()

In [ ]:
df['IR'] = df['IR'].str.replace('\W', '', regex=True)
df['IR'].head()

In [ ]:
df['Hits'].unique()

In [ ]:
for i in str(df['Hits'].unique()):
    if 'K' in i:
        df['Hits'].replace(i,float(i.replace('K','.').split('.'))[0]*1000,inplace = True)
    else:
        pass
df['Hits'].unique()

In [ ]:
df['Hits'] = pd.to_numeric(df['Hits']) 
df['Hits'].dtype

In [17]:
df[['W/F','SM','A/W','D/W']]

       W/F  SM     A/W     D/W
0      4 ★  4★  Medium     Low
1      4 ★  5★    High     Low
2      3 ★  1★  Medium  Medium
3      5 ★  4★    High    High
4      5 ★  5★    High  Medium
...    ...  ..     ...     ...
18974  2 ★  2★  Medium  Medium
18975  2 ★  2★  Medium  Medium
18976  2 ★  2★  Medium  Medium
18977  3 ★  2★  Medium  Medium
18978  3 ★  2★  Medium  Medium

[18979 rows x 4 columns]

In [19]:
df['W/F'] = df['W/F'].str.replace('\W', '', regex=True)
df['W/F'].head()

0    4
1    4
2    3
3    5
4    5
Name: W/F, dtype: object

In [20]:
df['SM'] = df['SM'].str.replace('\W', '', regex=True)
df['SM'].head()

0    4
1    5
2    1
3    4
4    5
Name: SM, dtype: object

In [23]:
df['A/W'].unique()

array(['Medium', 'High', 'Low'], dtype=object)

In [ ]:
df.describe()